<?php

/** @var yii\web\View $this */

$this->title = 'Регулярные выражения на PHP';
?>
<div class="site-index">

    <div class="jumbotron text-center bg-transparent mt-5 mb-5">
        <h1 class="display-4">Приветсвую Вас на сайте посвященном Регулярным Выражениям на PHP</h1>

        <p class="lead">Регулярные выражения - это очень интересная тема в программировании. В практике многих программистов случается так, что этот вопрос существует где-то на задворках
            их знаний и используется крайне редко. Девелоперы могут по-просту не знать его, а при этом это мощнейший инструмент по обработки данных, текстов, и т.д. И поэтому я решил посвятить этой теме отдельный сайт
        </p>

      
    </div>

    <div class="body-content">

        <div class="row">
            <div class="col-lg-4 mb-3">
                <h2>Шаблоны</h2>

                <p>Основы регулярных выражений - это шаблоны. В этом разделе будет рассматриваться их устройство, принцип формирования, и принцип использования
                    ключевых знаков в них.
                </p>

                <p><a class="btn btn-outline-secondary" href="/web/regex/patterns">Шаблоны &raquo;</a></p>
            </div>
            <div class="col-lg-4 mb-3">
                <h2>Функции PHP</h2>

                <p>В этом разделе будут рассмотрены ф-ции по работе с регулярным выражениями в PHP </p>

                <p><a class="btn btn-outline-secondary" href="/web/regex/functions">Функции &raquo;</a></p>
            </div>
            <div class="col-lg-4">
                <h2>Примеры</h2>

                <p>Здесь собраны интересные примеры использования регулярных выражений, с использованием разных функций</p>

                <p><a class="btn btn-outline-secondary" href="/web/regex/examples">Примеры &raquo;</a></p>
            </div>
        </div>

    </div>
</div>
